BsAtHome/atpack/Atmel.ATmega_DFP.atpack/edc/ATmega1284RFR2.PIC
        <edc:SFRDef edc:_addr="0x149" edc:access="nnnnnnnn" edc:cname="CCA_THRES" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCA_ED_THRES" edc:desc="ED Threshold Level for CCA Measurement" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="CCA_CS_THRES" edc:desc="CS Threshold Level for CCA Measurement" edc:nzwidth="0x4"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x14A" edc:access="----nnnn" edc:cname="RX_CTRL" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PDT_THRES" edc:desc="Receiver Sensitivity Control" edc:nzwidth="0x4">
                <edc:SFRFieldSemantic edc:cname="PDT_THRES_ANT_DIV_OFF" edc:desc="Reset value, to be used if Antenna Diversity algorithm is disabled" edc:when="(field &amp; 0xF) == 0x7"/>
                <edc:SFRFieldSemantic edc:cname="PDT_THRES_ANT_DIV_ON" edc:desc="Recommended correlator threshold for Antenna Diversity operation" edc:when="(field &amp; 0xF) == 0x3"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x14B" edc:access="nnnnnnnn" edc:cname="SFD_VALUE" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SFD_VALUE" edc:desc="Start of Frame Delimiter Value" edc:nzwidth="0x8">
                <edc:SFRFieldSemantic edc:cname="IEEE_SFD" edc:desc="IEEE 802.15.4 compliant value of the SFD" edc:when="(field &amp; 0xFF) == 0xA7"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x14C" edc:access="nnnnnnnn" edc:cname="TRX_CTRL_2" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="OQPSK_DATA_RATE" edc:desc="Data Rate Selection" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="RATE_250KB" edc:desc="250 kb/s (IEEE 802.15.4 compliant)" edc:when="(field &amp; 0x3) == 0"/>
                <edc:SFRFieldSemantic edc:cname="RATE_500KB" edc:desc="500 kb/s" edc:when="(field &amp; 0x3) == 1"/>
                <edc:SFRFieldSemantic edc:cname="RATE_1000KB" edc:desc="1000 kb/s" edc:when="(field &amp; 0x3) == 2"/>
                <edc:SFRFieldSemantic edc:cname="RATE_2000KB" edc:desc="2000 kb/s" edc:when="(field &amp; 0x3) == 3"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="Res" edc:desc="Reserved" edc:nzwidth="0x5"/>
              <edc:SFRFieldDef edc:cname="RX_SAFE_MODE" edc:desc="RX Safe Mode" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x14D" edc:access="nnnnnnnn" edc:cname="ANT_DIV" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ANT_CTRL" edc:desc="Static Antenna Diversity Switch Control" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="VAL_0" edc:desc="Reserved" edc:when="(field &amp; 0x3) == 0"/>
                <edc:SFRFieldSemantic edc:cname="ANT_1" edc:desc="Antenna 1: DIG1=H, DIG2=L" edc:when="(field &amp; 0x3) == 1"/>
                <edc:SFRFieldSemantic edc:cname="ANT_0" edc:desc="Antenna 0: DIG1=L, DIG2=H" edc:when="(field &amp; 0x3) == 2"/>
                <edc:SFRFieldSemantic edc:cname="ANT_RESET" edc:desc="Default value for ANT_EXT_SW_EN=0; Mandatory setting for applications not using Antenna Diversity" edc:when="(field &amp; 0x3) == 3"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="ANT_EXT_SW_EN" edc:desc="Enable External Antenna Switch Control" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:cname="ANT_DIV_EXT_SW_DIS" edc:desc="Antenna Diversity RF switch control disabled" edc:when="(field &amp; 0x1) == 0"/>
                <edc:SFRFieldSemantic edc:cname="ANT_DIV_EXT_SW_EN" edc:desc="Antenna Diversity RF switch control enabled" edc:when="(field &amp; 0x1) == 1"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="ANT_DIV_EN" edc:desc="Enable Antenna Diversity" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:cname="VAL_0" edc:desc="Antenna Diversity algorithm disabled" edc:when="(field &amp; 0x1) == 0"/>
                <edc:SFRFieldSemantic edc:cname="VAL_1" edc:desc="Antenna Diversity algorithm enabled" edc:when="(field &amp; 0x1) == 1"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="Res" edc:desc="Reserved" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="ANT_SEL" edc:desc="Antenna Diversity Antenna Status" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:cname="ANTENNA_0" edc:desc="Antenna 0" edc:when="(field &amp; 0x1) == 0"/>
                <edc:SFRFieldSemantic edc:cname="ANTENNA_1" edc:desc="Antenna 1" edc:when="(field &amp; 0x1) == 1"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x14E" edc:access="nnnnnnnn" edc:cname="IRQ_MASK" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PLL_LOCK_EN" edc:desc="PLL Lock Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PLL_UNLOCK_EN" edc:desc="PLL Unlock Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RX_START_EN" edc:desc="RX_START Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RX_END_EN" edc:desc="RX_END Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCA_ED_DONE_EN" edc:desc="End of ED Measurement Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AMI_EN" edc:desc="Address Match Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TX_END_EN" edc:desc="TX_END Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AWAKE_EN" edc:desc="Awake Interrupt Enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x14F" edc:access="nnnnnnnn" edc:cname="IRQ_STATUS" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PLL_LOCK" edc:desc="PLL Lock Interrupt Status" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PLL_UNLOCK" edc:desc="PLL Unlock Interrupt Status" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RX_START" edc:desc="RX_START Interrupt Status" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RX_END" edc:desc="RX_END Interrupt Status" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCA_ED_DONE" edc:desc="End of ED Measurement Interrupt Status" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AMI" edc:desc="Address Match Interrupt Status" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TX_END" edc:desc="TX_END Interrupt Status" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AWAKE" edc:desc="Awake Interrupt Status" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x150" edc:access="nn--nn--" edc:cname="VREG_CTRL" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="DVDD_OK" edc:desc="DVDD Supply Voltage Valid" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:cname="VAL_0" edc:desc="Digital voltage regulator disabled or supply voltage not stable" edc:when="(field &amp; 0x1) == 0"/>
                <edc:SFRFieldSemantic edc:cname="VAL_1" edc:desc="Digital supply voltage has settled" edc:when="(field &amp; 0x1) == 1"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="DVREG_EXT" edc:desc="Use External DVDD Regulator" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:cname="DVDD_INT" edc:desc="Internal DVDD voltage regulator for the digital section is enabled." edc:when="(field &amp; 0x1) == 0"/>
                <edc:SFRFieldSemantic edc:cname="DVDD_EXT" edc:desc="Internal DVDD voltage regulator is disabled; use external regulated 1.8V supply voltage for the digital section." edc:when="(field &amp; 0x1) == 1"/>
              </edc:SFRFieldDef>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="AVDD_OK" edc:desc="AVDD Supply Voltage Valid" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:cname="VAL_0" edc:desc="Analog voltage regulator disabled or supply voltage not stable" edc:when="(field &amp; 0x1) == 0"/>
                <edc:SFRFieldSemantic edc:cname="VAL_1" edc:desc="Analog supply voltage has settled" edc:when="(field &amp; 0x1) == 1"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="AVREG_EXT" edc:desc="Use External AVDD Regulator" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:cname="AVDD_INT" edc:desc="Internal AVDD voltage regulator for the analog section is enabled." edc:when="(field &amp; 0x1) == 0"/>
                <edc:SFRFieldSemantic edc:cname="AVDD_EXT" edc:desc="Internal AVDD voltage regulator is disabled; use external regulated 1.8V supply voltage for the analog section." edc:when="(field &amp; 0x1) == 1"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x151" edc:access="nnnnnnnn" edc:cname="BATMON" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BATMON_VTH" edc:desc="Battery Monitor Threshold Voltage" edc:nzwidth="0x4">
                <edc:SFRFieldSemantic edc:cname="VAL_0x0" edc:desc="2.550V / 1.70V (BATMON_HR=1/0)" edc:when="(field &amp; 0xF) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x1" edc:desc="2.625V / 1.75V (BATMON_HR=1/0)" edc:when="(field &amp; 0xF) == 0x1"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x2" edc:desc="2.700V / 1.80V (BATMON_HR=1/0)" edc:when="(field &amp; 0xF) == 0x2"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x3" edc:desc="2.775V / 1.85V (BATMON_HR=1/0)" edc:when="(field &amp; 0xF) == 0x3"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x4" edc:desc="2.850V / 1.90V (BATMON_HR=1/0)" edc:when="(field &amp; 0xF) == 0x4"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x5" edc:desc="2.925V / 1.95V (BATMON_HR=1/0)" edc:when="(field &amp; 0xF) == 0x5"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x6" edc:desc="3.000V / 2.00V (BATMON_HR=1/0)" edc:when="(field &amp; 0xF) == 0x6"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x7" edc:desc="3.075V / 2.05V (BATMON_HR=1/0)" edc:when="(field &amp; 0xF) == 0x7"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x8" edc:desc="3.150V / 2.10V (BATMON_HR=1/0)" edc:when="(field &amp; 0xF) == 0x8"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x9" edc:desc="3.225V / 2.15V (BATMON_HR=1/0)" edc:when="(field &amp; 0xF) == 0x9"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0xA" edc:desc="3.300V / 2.20V (BATMON_HR=1/0)" edc:when="(field &amp; 0xF) == 0xA"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0xB" edc:desc="3.375V / 2.25V (BATMON_HR=1/0)" edc:when="(field &amp; 0xF) == 0xB"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0xC" edc:desc="3.450V / 2.30V (BATMON_HR=1/0)" edc:when="(field &amp; 0xF) == 0xC"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0xD" edc:desc="3.525V / 2.35V (BATMON_HR=1/0)" edc:when="(field &amp; 0xF) == 0xD"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0xE" edc:desc="3.600V / 2.40V (BATMON_HR=1/0)" edc:when="(field &amp; 0xF) == 0xE"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0xF" edc:desc="3.675V / 2.45V (BATMON_HR=1/0)" edc:when="(field &amp; 0xF) == 0xF"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="BATMON_HR" edc:desc="Battery Monitor Voltage Range" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:cname="BATMON_HR_DIS" edc:desc="Enables the low range, see BATMON_VTH" edc:when="(field &amp; 0x1) == 0"/>
                <edc:SFRFieldSemantic edc:cname="BATMON_HR_EN" edc:desc="Enables the high range, see BATMON_VTH" edc:when="(field &amp; 0x1) == 1"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="BATMON_OK" edc:desc="Battery Monitor Status" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:cname="VAL_0" edc:desc="The battery voltage is below the threshold." edc:when="(field &amp; 0x1) == 0"/>
                <edc:SFRFieldSemantic edc:cname="VAL_1" edc:desc="The battery voltage is above the threshold." edc:when="(field &amp; 0x1) == 1"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="BAT_LOW_EN" edc:desc="Battery Monitor Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BAT_LOW" edc:desc="Battery Monitor Interrupt Status" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
