BsAtHome/atpack/Atmel.ATmega_DFP.atpack/edc/ATmega1284RFR2.PIC
        <edc:SFRDef edc:_addr="0x158" edc:access="n-------" edc:cname="FTN_CTRL" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x7"/>
              <edc:SFRFieldDef edc:cname="FTN_START" edc:desc="Start Calibration Loop of Filter Tuning Network" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0x159" edc:offset="0x1"/>
        <edc:SFRDef edc:_addr="0x15A" edc:access="n-------" edc:cname="PLL_CF" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x7"/>
              <edc:SFRFieldDef edc:cname="PLL_CF_START" edc:desc="Start Center Frequency Calibration" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x15B" edc:access="n-------" edc:cname="PLL_DCU" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x7"/>
              <edc:SFRFieldDef edc:cname="PLL_DCU_START" edc:desc="Start Delay Cell Calibration" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x15C" edc:access="nnnnnnnn" edc:cname="PART_NUM" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PART_NUM" edc:desc="Part Number" edc:nzwidth="0x8">
                <edc:SFRFieldSemantic edc:cname="P_ATmega128RFA1" edc:desc="ATmega128RFA1 part number" edc:when="(field &amp; 0xFF) == 0x83"/>
                <edc:SFRFieldSemantic edc:cname="P_RFA2" edc:desc="RFA2 family" edc:when="(field &amp; 0xFF) == 0x93"/>
                <edc:SFRFieldSemantic edc:cname="P_RFR2" edc:desc="RFR2 family" edc:when="(field &amp; 0xFF) == 0x94"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x15D" edc:access="nnnnnnnn" edc:cname="VERSION_NUM" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="VERSION_NUM" edc:desc="Version Number" edc:nzwidth="0x8">
                <edc:SFRFieldSemantic edc:cname="REV_A" edc:desc="Revision A" edc:when="(field &amp; 0xFF) == 12"/>
                <edc:SFRFieldSemantic edc:cname="REV_B" edc:desc="Revision B" edc:when="(field &amp; 0xFF) == 1"/>
                <edc:SFRFieldSemantic edc:cname="REV_C" edc:desc="Revision C" edc:when="(field &amp; 0xFF) == 3"/>
                <edc:SFRFieldSemantic edc:cname="REV_D" edc:desc="Revision D" edc:when="(field &amp; 0xFF) == 4"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x15E" edc:access="nnnnnnnn" edc:cname="MAN_ID_0" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MAN_ID_00" edc:desc="Manufacturer ID (Low Byte)" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:cname="ATMEL_BYTE_0" edc:desc="Atmel JEDEC manufacturer ID, bits [7:0] of 32 bit manufacturer ID: 00 00 00 1F" edc:when="(field &amp; 0x1) == 0x1f"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="MAN_ID_01" edc:desc="Manufacturer ID (Low Byte)" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MAN_ID_02" edc:desc="Manufacturer ID (Low Byte)" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MAN_ID_03" edc:desc="Manufacturer ID (Low Byte)" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MAN_ID_04" edc:desc="Manufacturer ID (Low Byte)" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MAN_ID_05" edc:desc="Manufacturer ID (Low Byte)" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MAN_ID_06" edc:desc="Manufacturer ID (Low Byte)" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MAN_ID_07" edc:desc="Manufacturer ID (Low Byte)" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x15F" edc:access="nnnnnnnn" edc:cname="MAN_ID_1" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MAN_ID_" edc:desc="Manufacturer ID (High Byte)" edc:nzwidth="0x8">
                <edc:SFRFieldSemantic edc:cname="ATMEL_BYTE_1" edc:desc="Atmel JEDEC manufacturer ID, bits [15:8] of 32 bit manufacturer ID: 00 00 00 1F" edc:when="(field &amp; 0xFF) == 0x00"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x160" edc:access="nnnnnnnn" edc:cname="SHORT_ADDR_0" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SHORT_ADDR_00" edc:desc="MAC Short Address" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SHORT_ADDR_01" edc:desc="MAC Short Address" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SHORT_ADDR_02" edc:desc="MAC Short Address" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SHORT_ADDR_03" edc:desc="MAC Short Address" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SHORT_ADDR_04" edc:desc="MAC Short Address" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SHORT_ADDR_05" edc:desc="MAC Short Address" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SHORT_ADDR_06" edc:desc="MAC Short Address" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SHORT_ADDR_07" edc:desc="MAC Short Address" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x161" edc:access="nnnnnnnn" edc:cname="SHORT_ADDR_1" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SHORT_ADDR_" edc:desc="MAC Short Address" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x162" edc:access="nnnnnnnn" edc:cname="PAN_ID_0" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PAN_ID_00" edc:desc="MAC Personal Area Network ID" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PAN_ID_01" edc:desc="MAC Personal Area Network ID" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PAN_ID_02" edc:desc="MAC Personal Area Network ID" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PAN_ID_03" edc:desc="MAC Personal Area Network ID" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PAN_ID_04" edc:desc="MAC Personal Area Network ID" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PAN_ID_05" edc:desc="MAC Personal Area Network ID" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PAN_ID_06" edc:desc="MAC Personal Area Network ID" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PAN_ID_07" edc:desc="MAC Personal Area Network ID" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x163" edc:access="nnnnnnnn" edc:cname="PAN_ID_1" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PAN_ID_" edc:desc="MAC Personal Area Network ID" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x164" edc:access="nnnnnnnn" edc:cname="IEEE_ADDR_0" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IEEE_ADDR_00" edc:desc="MAC IEEE Address" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IEEE_ADDR_01" edc:desc="MAC IEEE Address" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IEEE_ADDR_02" edc:desc="MAC IEEE Address" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IEEE_ADDR_03" edc:desc="MAC IEEE Address" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IEEE_ADDR_04" edc:desc="MAC IEEE Address" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IEEE_ADDR_05" edc:desc="MAC IEEE Address" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IEEE_ADDR_06" edc:desc="MAC IEEE Address" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IEEE_ADDR_07" edc:desc="MAC IEEE Address" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
